$cmd = "code --list-extensions"

//-------

arcticicestudio.nord-visual-studio-code
bierner.comment-tagged-templates
circledev.glsl-canvas
CoenraadS.bracket-pair-colorizer
dbaeumer.vscode-eslint
dsznajder.es7-react-js-snippets
eamodio.gitlens
EditorConfig.EditorConfig
esbenp.prettier-vscode
extemporelang.vscode-extempore
formulahendry.auto-rename-tag
JamesBirtles.svelte-vscode
justusadam.language-haskell
ritwickdey.live-sass
ritwickdey.LiveServer
slevesque.shader
tidalcycles.vscode-tidalcycles
vscodevim.vim
xabikos.JavaScriptSnippets
Yummygum.city-lights-icon-vsc
yzhang.markdown-all-in-one

//-------

while read line; do code --install-extension "$line";done < vscode-extensions.txt

//-------