;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

(package! extempore-mode)
(package! nov)
(package! processing-mode)
(package! ox-gfm)
(package! org-super-agenda)
(package! sclang-extensions)
(package! glsl-mode)
(package! ranger)
(package! prisma-mode :recipe (:host github :repo "pimeys/emacs-prisma-mode" :branch "main"))
