;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

(package! extempore-mode)
(package! processing-mode)
(package! ranger)
(package! tidal)
(package! fill-column-indicator)
(package! highlight-indent-guides)
(package! typescript-mode)
(package! web-mode)
;; (package! org-super-agenda)
;; (package! org-brain)
;; (package! org-fancy-priorities)
;; (package! ccls :disable t)
