;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

(package! straight :pin "3eca39d")
(package! tidal)
(package! nov)
(package! ox-gfm)
(package! sclang-extensions)
(package! glsl-mode)
(package! ranger)
(package! denote)
(package! graphviz-dot-mode)
;; (package! org-super-agenda)
;; (package! processing-mode)
;; (package! extempore-mode)
